DCSoyuz/ad3s/ad3s_prog_esp32/main/esp32_dma_spi_master.hpp
// Copyright (c) 2019 hideakitai
// SPDX-License-Identifier: MIT
//
// Vendored from https://github.com/hideakitai/arduino-esp32-dma-spi (MIT).
// Modified for ad3s_prog_esp32: added #include "ad3s_types.hpp" and remapped
// SPI pins/GPIO constants to this project's pin table.
#pragma once
#ifndef ESP32_DMA_SPI_MASTER_HPP
#define ESP32_DMA_SPI_MASTER_HPP

#include <stdio.h>
#include <stdint.h>
#include <stddef.h>
#include <string.h>
#include <stdlib.h>
#include <math.h>

//#include "driver/spi_common.h"
//#include "driver/spi_types.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "freertos/queue.h"
#include "driver/gpio.h"
#include "driver/spi_master.h"
#include "esp_log.h"
#include "driver/uart.h"
#include "sdkconfig.h"
#include "soc/spi_struct.h"
#include "hal/spi_ll.h"
#include "ad3s_types.hpp"
#include <vector>
#include <memory>

#include <functional>

#ifndef ARDUINO_ESP32_DMA_SPI_NAMESPACE_BEGIN
#define ARDUINO_ESP32_DMA_SPI_NAMESPACE_BEGIN \
    namespace arduino {                       \
    namespace esp32 {                         \
        namespace spi {                       \
            namespace dma {
#endif
#ifndef ARDUINO_ESP32_DMA_SPI_NAMESPACE_END
#define ARDUINO_ESP32_DMA_SPI_NAMESPACE_END \
    }                                       \
    }                                       \
    }                                       \
    }
#endif

ARDUINO_ESP32_DMA_SPI_NAMESPACE_BEGIN


static constexpr const char *TAG = "ESP32DMASPIMaster";
static constexpr int SPI_MASTER_TASK_STACK_SIZE = 1024 * 4; // 4096 bytes for std::vector + logging
static constexpr int SPI_MASTER_TASK_PRIORITY = 12;

static QueueHandle_t s_trans_queue_handle {NULL};
static constexpr int SEND_TRANS_QUEUE_TIMEOUT_TICKS = pdMS_TO_TICKS(5000);
static constexpr int RECV_TRANS_QUEUE_TIMEOUT_TICKS = portMAX_DELAY;
static QueueHandle_t s_trans_result_handle {NULL};
static constexpr int SEND_TRANS_RESULT_TIMEOUT_TICKS = pdMS_TO_TICKS(5000);
static constexpr int RECV_TRANS_RESULT_TIMEOUT_TICKS = 0;
static QueueHandle_t s_in_flight_mailbox_handle {NULL};

static spi_ll_clock_val_t s_forced_clock_reg {};
static bool s_use_forced_clock = false;

// ################### MY DEF ###############
static constexpr int SPI_MODE0 = 0;
static constexpr int HSPI = 1;
static constexpr int VSPI = 2;
static constexpr int FSPI = 0;
// ################## END MY DEF ############



using spi_master_user_cb_t = std::function<void(spi_transaction_t*, void*)>;

static void spi_master_pre_cb(spi_transaction_t* trans);
static void spi_master_post_cb(spi_transaction_t* trans);
struct spi_master_context_t
{
    spi_device_interface_config_t if_cfg {
        .command_bits = 0,  // 0-16
        .address_bits = 0,  // 0-64
        .dummy_bits = 0,
        .mode = SPI_MODE0,
        .duty_cycle_pos = 128,  // default: 128
        .cs_ena_pretrans = 2,   // only for half-duplex
        .cs_ena_posttrans = 0,
        .clock_speed_hz = SPI_MASTER_FREQ_8M,
        .input_delay_ns = 0,
        .spics_io_num = idf::GPIO_CS,
        .flags = 0,
        .queue_size = 1,
        .pre_cb = spi_master_pre_cb,
        .post_cb = spi_master_post_cb,
    };
    spi_bus_config_t bus_cfg {
        .mosi_io_num = idf::GPIO_MOSI, // union with data0_io_num
        .miso_io_num = idf::GPIO_MISO, // union with data1_io_num
        .sclk_io_num = idf::GPIO_SCLK,
        .data2_io_num = -1,  // union with quadwp_io_num
        .data3_io_num = -1,  // union with quadhd_io_num
        .data4_io_num = -1,
        .data5_io_num = -1,
        .data6_io_num = -1,
        .data7_io_num = -1,
        .max_transfer_sz = 4092,  // default: 4092 if DMA enabled, SOC_SPI_MAXIMUM_BUFFER_SIZE if DMA disabled
        .flags = SPICOMMON_BUSFLAG_MASTER ,
        // .isr_cpu_id = ESP_INTR_CPU_AFFINITY_1,
        .intr_flags = 0,
    };
    spi_host_device_t host {SPI2_HOST};
    int dma_chan {SPI_DMA_CH_AUTO};  // must be 1, 2 or AUTO
};

struct spi_transaction_context_t
{
    spi_transaction_ext_t *trans_ext;
    size_t size;
    TickType_t timeout_ticks;
};

struct spi_master_cb_user_context_t
{
    struct {
        spi_master_user_cb_t user_cb;
        void *user_arg;
    } pre;
    struct {
        spi_master_user_cb_t user_cb;
        void *user_arg;
    } post;
};

static void IRAM_ATTR spi_master_pre_cb(spi_transaction_t* trans)
{
    if (s_use_forced_clock) {
        spi_ll_master_set_clock_by_reg(&GPSPI2, &s_forced_clock_reg);
    }
    spi_master_cb_user_context_t *user_ctx = static_cast<spi_master_cb_user_context_t*>(trans->user);
    if (user_ctx->pre.user_cb) {
        user_ctx->pre.user_cb(trans, user_ctx->pre.user_arg);
    }
}

static void IRAM_ATTR spi_master_post_cb(spi_transaction_t* trans)
{
    spi_master_cb_user_context_t *user_ctx = static_cast<spi_master_cb_user_context_t*>(trans->user);
    if (user_ctx->post.user_cb) {
        user_ctx->post.user_cb(trans, user_ctx->post.user_arg);
    }
}


static   spi_device_handle_t device_handle;



static void spi_master_task(void *arg)
{
    ESP_LOGD(TAG, "spi_master_task start");

    spi_master_context_t *ctx = static_cast<spi_master_context_t*>(arg);

    // initialize spi bus
    esp_err_t err = spi_bus_initialize(ctx->host, &ctx->bus_cfg, ctx->dma_chan);
    assert(err == ESP_OK);

    // add spi device
  
    ESP_LOGI(TAG, "spi_master_task init: clock_speed_hz=%d, clock_source=%d, flags=0x%x",
             ctx->if_cfg.clock_speed_hz, (int)ctx->if_cfg.clock_source, ctx->if_cfg.flags);
    err = spi_bus_add_device(ctx->host, &ctx->if_cfg, &device_handle);
    assert(err == ESP_OK);

    // initialize queues
    s_trans_queue_handle = xQueueCreate(1, sizeof(spi_transaction_context_t));
    assert(s_trans_queue_handle != NULL);
    s_trans_result_handle = xQueueCreate(ctx->if_cfg.queue_size, sizeof(size_t));
    assert(s_trans_result_handle != NULL);
    s_in_flight_mailbox_handle = xQueueCreate(1, sizeof(size_t));
    assert(s_in_flight_mailbox_handle != NULL);

