DCSoyuz/ad3s/ad3s_prog_esp32/main/esp32_dma_spi_master.hpp
    // spi task
    while (true) {
        spi_transaction_context_t trans_ctx;
        if (xQueueReceive(s_trans_queue_handle, &trans_ctx, RECV_TRANS_QUEUE_TIMEOUT_TICKS)) {
            // update in-flight count
            assert(trans_ctx.trans_ext != nullptr);
            assert(trans_ctx.size <= ctx->if_cfg.queue_size);
            xQueueOverwrite(s_in_flight_mailbox_handle, &trans_ctx.size);

            // execute new transaction if transaction request received from main task
            ESP_LOGD(TAG, "new transaction request received (size = %u)", trans_ctx.size);
            std::vector<esp_err_t> errs;
            errs.reserve(trans_ctx.size);
            for (size_t i = 0; i < trans_ctx.size; ++i) {
                spi_transaction_t *trans = (spi_transaction_t*)(&trans_ctx.trans_ext[i]);

                esp_err_t err = spi_device_queue_trans(device_handle, trans, trans_ctx.timeout_ticks);
                if (err != ESP_OK) {
                    ESP_LOGE(TAG, "failed to execute spi_device_queue_trans(): 0x%X", err);
                }
                errs.push_back(err);
            }

            // wait for the completion of all of the queued transactions
            for (size_t i = 0; i < trans_ctx.size; ++i) {
                // wait for completion of next transaction
                size_t num_received_bytes = 0;
                if (errs[i] == ESP_OK) {
                    spi_transaction_t *rtrans;
                    esp_err_t err = spi_device_get_trans_result(device_handle, &rtrans, trans_ctx.timeout_ticks);
                    if (err != ESP_OK) {
                        ESP_LOGE(TAG, "failed to execute spi_device_get_trans_result(): 0x%X", err);
                    } else {
                        num_received_bytes = rtrans->rxlength / 8; // bit -> byte
                        ESP_LOGD(TAG, "transaction complete: %d bits (%d bytes) received", rtrans->rxlength, num_received_bytes);
                    }
                } else {
                    ESP_LOGE(TAG, "skip spi_device_get_trans_result() because queue was failed: index = %u", i);
                }

                // send the received bytes back to main task
                if (uxQueueSpacesAvailable(s_trans_result_handle) == 0) {
                    size_t discard_oldest_result = 0;
                    if (!xQueueReceive(s_trans_result_handle, &discard_oldest_result, 0)) {
                        ESP_LOGE(TAG, "failed to discard the oldest queued result");
                    }
                }
                if (!xQueueSend(s_trans_result_handle, &num_received_bytes, SEND_TRANS_RESULT_TIMEOUT_TICKS)) {
                    ESP_LOGE(TAG, "failed to send a number of received bytes to main task: %d", err);
                }

                // update in-flight count
                const size_t num_rest_in_flight = trans_ctx.size - (i + 1);
                xQueueOverwrite(s_in_flight_mailbox_handle, &num_rest_in_flight);
            }

            // should be deleted because the ownership is moved from main task
            delete[] trans_ctx.trans_ext;

            ESP_LOGD(TAG, "all requested transactions completed");
        }

        // terminate task if requested
        if (xTaskNotifyWait(0, 0, NULL, 0) == pdTRUE) {
            break;
        }
    }

    ESP_LOGD(TAG, "terminate spi task as requested by the main task");

    vQueueDelete(s_in_flight_mailbox_handle);
    vQueueDelete(s_trans_result_handle);
    vQueueDelete(s_trans_queue_handle);

    spi_bus_remove_device(device_handle);
    spi_bus_free(ctx->host);

    vTaskDelete(NULL);
}

class Master
{
    spi_master_context_t ctx;
    std::vector<spi_transaction_ext_t> transactions;
    spi_master_cb_user_context_t cb_user_ctx;
    TaskHandle_t spi_task_handle {NULL};

public:

    void captureSpiBusDmaQuad(bool useEnc2 = false){
        setContextForQuadDma(useEnc2);
        captureSpiBus();
    }

    void captureSpiBusDmaSingle(){
        setContextForSingleDma();
        captureSpiBus();
    }

    void captureSpiBus(){
        ESP_LOGI(TAG, "captureSpiBus: clock_speed_hz=%d, clock_source=%d, flags=0x%x, mode=%d, queue_size=%d",
                 this->ctx.if_cfg.clock_speed_hz, (int)this->ctx.if_cfg.clock_source,
                 this->ctx.if_cfg.flags, this->ctx.if_cfg.mode, this->ctx.if_cfg.queue_size);
        esp_err_t err = spi_bus_initialize(this->ctx.host, &this->ctx.bus_cfg, this->ctx.dma_chan);
        assert(err == ESP_OK);
        err = spi_bus_add_device(this->ctx.host, &this->ctx.if_cfg, &device_handle);
        ESP_LOGI(TAG, "captureSpiBus: spi_bus_add_device err=0x%x, device_handle=%p", err, (void*)device_handle);
        assert(err == ESP_OK);

        // Calculate correct clock register and enable pre_cb override
        int freq = this->ctx.if_cfg.clock_speed_hz;
        int eff_clk = spi_ll_master_cal_clock(APB_CLK_FREQ, freq, 128, &s_forced_clock_reg);
        s_use_forced_clock = true;
        ESP_LOGI(TAG, "captureSpiBus: forced clock reg=0x%08x, eff_clk=%d Hz",
                 *(uint32_t*)&s_forced_clock_reg, eff_clk);
    }

    void releaseSpiBus(){
        s_use_forced_clock = false;
        ESP_LOGI(TAG,"Master start releaseSpiBus!");
        esp_err_t ret = spi_bus_remove_device(device_handle);
        assert(ret==ESP_OK);
        ret = spi_bus_free (this->ctx.host);
        assert(ret==ESP_OK);
        ESP_LOGI(TAG,"Master end releaseSpiBus!");
    }



    static spi_device_handle_t  getDeviceHandle(){
        return device_handle;
    }




    /// @brief initialize SPI with the default pin assignment for HSPI, FSPI or VSPI
    /// @param spi_bus HSPI, FSPI or VSPI
    /// @return true if initialization succeeded, false otherwise
    bool begin(uint8_t spi_bus = HSPI)
    {
#ifdef CONFIG_IDF_TARGET_ESP32
        this->ctx.if_cfg.spics_io_num = idf::GPIO_CS;
        this->ctx.bus_cfg.sclk_io_num = idf::GPIO_SCLK;
        this->ctx.bus_cfg.mosi_io_num = idf::GPIO_MOSI;
        this->ctx.bus_cfg.miso_io_num =idf::GPIO_MISO;
#endif
        return this->initialize(spi_bus);
    }
    /// @brief initialize SPI with HSPI/FSPI/VSPI, sck, miso, mosi, and ss pins
    /// @param spi_bus HSPI or VSPI (or FSIP)
    /// @param sck
    /// @param miso
    /// @param mosi
    /// @param ss
    /// @return true if initialization succeeded, false otherwise
    bool begin(uint8_t spi_bus, int sck, int miso, int mosi, int ss)
    {
        this->ctx.if_cfg.spics_io_num = ss;
        this->ctx.bus_cfg.sclk_io_num = sck;
        this->ctx.bus_cfg.mosi_io_num = mosi;
        this->ctx.bus_cfg.miso_io_num = miso;
        return this->initialize(spi_bus);
    }
    /// @brief initialize SPI with HSPI/FSPI/VSPI and Qued SPI pins
    /// @param spi_bus HSPI, FSPI or VSPI
    /// @param sck
    /// @param ss
    /// @param data0
    /// @param data1
    /// @param data2
    /// @param data3
    /// @note if you want quad spi with WP and HD pins, please use data0 as MOSI, data1 as MISO, data2 as WP, and data3 as HD
    bool beginQuad(uint8_t spi_bus)
    {
        this->setContextForQuadDma();
        return this->initialize(spi_bus);
    }

  bool beginSingle(uint8_t spi_bus)
    {
        this->setContextForSingleDma();
        return this->initialize(spi_bus);
    }


    /// @brief initialize SPI with HSPI/FSPI/VSPI and Octo SPI pins
    /// @param spi_bus HSPI, FSPI or VSPI
    /// @param sck
    /// @param ss
    /// @param data0
    /// @param data1
    /// @param data2
    /// @param data3
    /// @param data4
    /// @param data5
    /// @param data6
    /// @param data7
    bool begin(uint8_t spi_bus, int sck, int ss, int data0, int data1, int data2, int data3, int data4, int data5, int data6, int data7)
    {
        this->ctx.if_cfg.spics_io_num = ss;
        this->ctx.bus_cfg.sclk_io_num = sck;
        this->ctx.bus_cfg.data0_io_num = data0;
        this->ctx.bus_cfg.data1_io_num = data1;
        this->ctx.bus_cfg.data2_io_num = data2;
        this->ctx.bus_cfg.data3_io_num = data3;
        this->ctx.bus_cfg.data4_io_num = data4;
        this->ctx.bus_cfg.data5_io_num = data5;
        this->ctx.bus_cfg.data6_io_num = data6;
        this->ctx.bus_cfg.data7_io_num = data7;
        return this->initialize(spi_bus);
    }

    /// @brief stop spi master (terminate spi_master_task and deinitialize spi)
    void end()
    {
        xTaskNotifyGive(spi_task_handle);
    }

