DCSoyuz/ad3s/ad3s_prog_esp32/main/esp32_dma_spi_master.hpp
    /// @brief allocate dma memory buffer (requires the memory allocated with this method for dma)
    /// @param n_bytes the size of buffer in bytes
    /// @return pointer to the allocated dma buffer
    static uint8_t *allocDMABuffer(size_t n_bytes)
    {
        if (n_bytes % 4 != 0) {
            ESP_LOGW(TAG, "failed to allocate dma buffer: must be multiples of 4 bytes");
            return nullptr;
        }
        return static_cast<uint8_t*>(heap_caps_calloc(n_bytes, sizeof(uint8_t), MALLOC_CAP_DMA));
    }

    /// @brief execute one transaction using polling (no ISR, direct hardware access)
    /// @param flags SPI_TRANS_* flags
    /// @param tx_buf pointer to the buffer of data to be sent
    /// @param rx_buf pointer to the buffer of data to be received
    /// @param size size of data in bytes
    /// @return the size of received bytes
    size_t transferPolling(uint32_t flags, const uint8_t* tx_buf, uint8_t* rx_buf, size_t size)
    {
        spi_transaction_ext_t trans = generateTransaction(0, 0, 0, flags, 0, 0, size, tx_buf, rx_buf);
        spi_transaction_t *t = (spi_transaction_t*)&trans;
        esp_err_t err = spi_device_polling_transmit(device_handle, t);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "spi_device_polling_transmit failed: 0x%x", err);
            return 0;
        }
        return t->rxlength / 8;
    }

    /// @brief execute one transaction and wait for the completion
    /// @param tx_buf pointer to the buffer of data to be sent
    /// @param rx_buf pointer to the buffer of data to be received
    /// @param size size of data to be sent
    /// @param timeout_ms timeout in milliseconds
    /// @return the size of received bytes
    /// @note  this function is blocking until the completion of transmission
    size_t transfer(uint32_t flags, const uint8_t* tx_buf, uint8_t* rx_buf, size_t size, uint32_t timeout_ms = 0)
    {
        return this->transfer(0, 0, 0, flags, 0, 0, tx_buf, rx_buf, size, timeout_ms);
    }
    /// @brief execute one transaction and wait for the completion of transmission to return the result
    /// @param command_bits number of bits in command phase (0-16)
    /// @param address_bits number of bits in address phase (0-64)
    /// @param dummy_bits number of dummy bits to insert between address and data phase (0-64)
    /// @param flags SPI_TRANS_* flags
    /// @param cmd command to send
    /// @param addr address to send
    /// @param tx_buf pointer to the buffer of data to be sent
    /// @param rx_buf pointer to the buffer of data to be received
    /// @param size size of data to be sent
    /// @param timeout_ms timeout in milliseconds
    /// @return the size of received bytes
    /// @note  this function is blocking until the completion of transmission
    size_t transfer(
        uint8_t command_bits,
        uint8_t address_bits,
        uint8_t dummy_bits,
        uint32_t flags,
        uint16_t cmd,
        uint64_t addr,
        const uint8_t* tx_buf,
        uint8_t* rx_buf,
        size_t size,
        uint32_t timeout_ms
    ) {
        if (!this->queue(command_bits, address_bits, dummy_bits, flags, cmd, addr, tx_buf, rx_buf, size)) {
            return 0;
        }
        const auto results = this->wait(timeout_ms);
        if (results.empty()) {
            return 0;
        } else {
            return results[results.size() - 1];
        }
    }

    /// @brief  queue transaction to internal transaction buffer.
    ///         To start transaction, wait() or trigger() must be called.
    /// @param tx_buf pointer to the buffer of data to be sent
    /// @param rx_buf pointer to the buffer of data to be received
    /// @param size size of data to be sent
    /// @return true if the transaction is queued successfully, false otherwise
    bool queue(const uint8_t* tx_buf, uint8_t* rx_buf, size_t size)
    {
        return this->queue(0, 0, 0, 0, 0, 0, tx_buf, rx_buf, size);
    }
    /// @brief  queue transaction to internal transaction buffer.
    ///         To start transaction, wait() or trigger() must be called.
    /// @param command_bits number of bits in command phase (0-16)
    /// @param address_bits number of bits in address phase (0-64)
    /// @param dummy_bits number of dummy bits to insert between address and data phase (0-64)
    /// @param flags SPI_TRANS_* flags
    /// @param cmd command to send
    /// @param addr address to send
    /// @param tx_buf pointer to the buffer of data to be sent
    /// @param rx_buf pointer to the buffer of data to be received
    /// @param size size of data to be sent
    /// @return true if the transaction is queued successfully, false otherwise
    bool queue(
        uint8_t command_bits,
        uint8_t address_bits,
        uint8_t dummy_bits,
        uint32_t flags,
        uint16_t cmd,
        uint64_t addr,
        const uint8_t* tx_buf,
        uint8_t* rx_buf,
        size_t size
    ) {
        if (size % 4 != 0) {
            ESP_LOGW(TAG, "failed to queue transaction: buffer size must be multiples of 4 bytes");
            return false;
        }
        if (this->transactions.size() >= this->ctx.if_cfg.queue_size) {
            ESP_LOGW(TAG, "failed to queue transaction: queue is full - only %u transactions can be queued at once", this->ctx.if_cfg.queue_size);
            return false;
        }
        this->queueTransaction(command_bits, address_bits, dummy_bits, flags, cmd, addr, size, tx_buf, rx_buf);
        return true;
    }

    /// @brief execute queued transactions and wait for the completion.
    ///        rx_buf is automatically updated after the completion of each transaction.
    /// @param timeout_ms timeout in milliseconds
    /// @return a vector of the received bytes for all transactions
    std::vector<size_t> wait(uint32_t timeout_ms = 0)
    {
        size_t num_will_be_queued = this->transactions.size();
        if (!this->trigger(timeout_ms)) {
            return std::vector<size_t>();
        }
        return this->waitTransaction(num_will_be_queued);
    }

