DCSoyuz/ad3s/ad3s_prog_esp32/main/esp32_dma_spi_master.hpp
    /// @brief Duty cycle of positive clock, in 1/256th increments (128 = 50%/50% duty). Setting this to 0 (=not setting it) is equivalent to setting this to 128.
    /// @param n
    void setDutyCyclePos(uint8_t n) { this->ctx.if_cfg.duty_cycle_pos = n; }

    /// @brief SPI clock speed in Hz. Derived from clock_source.
    /// @param f
    void setClockSpeedHz(size_t f) { this->ctx.if_cfg.clock_speed_hz = f; }

    /// @brief Maximum data valid time of slave. The time required between SCLK and MISO valid, including the possible clock delay from slave to master. The driver uses this value to give an extra delay before the MISO is ready on the line. Leave at 0 unless you know you need a delay. For better timing performance at high frequency (over 8MHz), it's suggest to have the right value.
    /// @param n
    void setInputDelayNs(int n) { this->ctx.if_cfg.input_delay_ns = n; }

    /// @brief Bitwise OR of SPI_DEVICE_* flags.
    /// @param flags
    void setDeviceFlags(uint32_t flags) { this->ctx.if_cfg.flags = flags; }

    /// @brief Callback to be called before a transmission is started.
    /// @param pre_cb
    /// @note  This callback is called within interrupt context should be in IRAM for best performance, see "Transferring Speed" section in the SPI Master documentation for full details. If not, the callback may crash during flash operation when the driver is initialized with ESP_INTR_FLAG_IRAM.
    void setPreCb(const transaction_cb_t pre_cb) { this->ctx.if_cfg.pre_cb = pre_cb; }

    /// @brief Callback to be called after a transmission has completed.
    /// @param post_cb
    /// @note  This callback is called within interrupt context should be in IRAM for best performance, see "Transferring Speed" section in the SPI Master documentation for full details. If not, the callback may crash during flash operation when the driver is initialized with ESP_INTR_FLAG_IRAM.
    void setPostCb(const transaction_cb_t post_cb) { this->ctx.if_cfg.post_cb = post_cb; }

    /// @brief set pre callback (ISR) and its argument that are called before transaction started.
    ///        you can call this function before every transfer() / queue() to change the behavior per transaction.
    ///        see more details about callbacks at https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-reference/peripherals/spi_master.html#_CPPv4N29spi_device_interface_config_t6pre_cbE
    /// @param cb  callback that is called when pre callbacks are called
    /// @param arg pointer to your own data that you want to pass to the callbak
    /// @note      pre callbacks will be called within the interrupt context
    void setUserPreCbAndArg(const spi_master_user_cb_t &cb, void *arg)
    {
        this->cb_user_ctx.pre.user_cb = cb;
        this->cb_user_ctx.pre.user_arg = arg;
    }
    /// @brief set post callback (ISR) and its argument that are called after transaction completed.
    ///        you can call this function before every transfer() / queue() to change the behavior per transaction.
    ///        see more details about callbacks at https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-reference/peripherals/spi_master.html#_CPPv4N29spi_device_interface_config_t6pre_cbE
    /// @param cb  callback that is called when pre/post callbacks are called
    /// @param arg pointer to your own data that you want to pass to the callbak
    /// @note      post callbacks will be called within the interrupt context
    void setUserPostCbAndArg(const spi_master_user_cb_t &cb, void *arg)
    {
        this->cb_user_ctx.post.user_cb = cb;
        this->cb_user_ctx.post.user_arg = arg;
    }


    void setContextForQuadDma(bool useEnc2 = false){
        this->ctx.if_cfg.spics_io_num = idf::GPIO_CS;
        this->ctx.if_cfg.flags = SPI_DEVICE_HALFDUPLEX;
        this->ctx.if_cfg.clock_speed_hz = 10000000;
        this->ctx.if_cfg.cs_ena_pretrans = 2;
        this->ctx.if_cfg.cs_ena_posttrans = 0;
        this->ctx.if_cfg.mode = 0;
        this->ctx.if_cfg.clock_source = SPI_CLK_SRC_DEFAULT;
        this->ctx.bus_cfg.sclk_io_num = idf::GPIO_SCLK;
        if(useEnc2){
            // SDI=1: IC outputs data on ENC2 pins (sensor 2, contour C2)
            this->ctx.bus_cfg.data0_io_num = idf::GPIO_ENC2_0;
            this->ctx.bus_cfg.data1_io_num = idf::GPIO_MISO;
            this->ctx.bus_cfg.data2_io_num = idf::GPIO_ENC2_A;
            this->ctx.bus_cfg.data3_io_num = idf::GPIO_ENC2_B;
        } else {
            // SDI=0: IC outputs data on ENC1 pins (sensor 1, contour C1)
            this->ctx.bus_cfg.data0_io_num = idf::GPIO_ENC1_0;
            this->ctx.bus_cfg.data1_io_num = idf::GPIO_MISO;
            this->ctx.bus_cfg.data2_io_num = idf::GPIO_ENC1_A;
            this->ctx.bus_cfg.data3_io_num = idf::GPIO_ENC1_B;
        }
        this->ctx.bus_cfg.flags = SPICOMMON_BUSFLAG_QUAD;
        ESP_LOGI(TAG, "setContextForQuadDma: useEnc2=%d, data0=%d, data2=%d, data3=%d, clock=%d",
                 useEnc2,
                 useEnc2 ? idf::GPIO_ENC2_0 : idf::GPIO_ENC1_0,
                 useEnc2 ? idf::GPIO_ENC2_A : idf::GPIO_ENC1_A,
                 useEnc2 ? idf::GPIO_ENC2_B : idf::GPIO_ENC1_B,
                 this->ctx.if_cfg.clock_speed_hz);
    }

   

    void setContextForSingleDma(){
        this->ctx.if_cfg.spics_io_num  = idf::GPIO_CS;
        this->ctx.if_cfg.flags = 0;
        this->ctx.bus_cfg.sclk_io_num  = idf::GPIO_SCLK;
        this->ctx.bus_cfg.mosi_io_num  = idf::GPIO_MOSI;
        this->ctx.bus_cfg.miso_io_num  = idf::GPIO_MISO;
        this->ctx.bus_cfg.flags = SPICOMMON_BUSFLAG_MASTER;
    }

private:
    static spi_host_device_t hostFromBusNumber(uint8_t spi_bus)
    {
        switch (spi_bus) {
            case FSPI:
#ifdef CONFIG_IDF_TARGET_ESP32
                return SPI1_HOST;
#else
                return SPI2_HOST;
#endif
            case HSPI:
#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32C3)
                return SPI2_HOST;
#else
                return SPI3_HOST;
#endif
#ifdef CONFIG_IDF_TARGET_ESP32
            case VSPI:
                return SPI3_HOST;
#endif
            default:
                return SPI2_HOST;
        }
    }

    bool initialize(uint8_t spi_bus)
    {
        this->ctx.host = this->hostFromBusNumber(spi_bus);
        //this->ctx.bus_cfg.flags |= SPICOMMON_BUSFLAG_MASTER;
        this->transactions.reserve(this->ctx.if_cfg.queue_size);
        ESP_LOGD(TAG, "initialize");
        ESP_LOGI(TAG, "flags:%d", (int) this->ctx.if_cfg.flags);
        // create spi master task
        std::string task_name = std::string("spi_master_task_") + std::to_string(this->ctx.if_cfg.spics_io_num);
        int ret = xTaskCreatePinnedToCore(spi_master_task, task_name.c_str(), SPI_MASTER_TASK_STACK_SIZE, static_cast<void*>(&this->ctx), SPI_MASTER_TASK_PRIORITY, &spi_task_handle, 1);
        if (ret != pdPASS) {
            ESP_LOGE(TAG, "failed to create spi_master_task: %d", ret);
            return false;
        }

