DCSoyuz/ad3s/ad3s_prog_esp32/main/esp32_dma_spi_master.hpp
        return true;
    }



    spi_transaction_ext_t generateTransaction(
        uint8_t command_bits,
        uint8_t address_bits,
        uint8_t dummy_bits,
        uint32_t flags,
        uint16_t cmd,
        uint64_t addr,
        size_t size,
        const uint8_t* tx_buf,
        uint8_t* rx_buf
    ) {
        spi_transaction_ext_t trans;

        // allow variable cmd/addr/dummy bits based on spi_transaction_ext_t
        trans.base.flags = flags;
        trans.base.cmd = cmd;
        trans.base.addr = addr;
        trans.base.length = 8 * size;  // in bit size
        trans.base.rxlength =  8 * size; // set to same one with length
        trans.base.user = &this->cb_user_ctx; // user-defined callback and arg
        if(flags == SPI_TRANS_MODE_QIO){
            trans.base.tx_buffer = NULL;
            trans.base.length = 0;  // no tx phase in half-duplex QIO read mode
        }else {
            trans.base.tx_buffer = tx_buf;
        }
        trans.base.rx_buffer = rx_buf;//NULL; //(rx_buf == nullptr) ? NULL : rx_buf;

        trans.command_bits = command_bits;
        trans.address_bits = address_bits;
        trans.dummy_bits = dummy_bits;

        return trans;
    }

    void queueTransaction(
        uint8_t command_bits,
        uint8_t address_bits,
        uint8_t dummy_bits,
        uint32_t flags,
        uint16_t cmd,
        uint64_t addr,
        size_t size,
        const uint8_t* tx_buf,
        uint8_t* rx_buf
    ) {
        spi_transaction_ext_t trans_ext = generateTransaction(command_bits, address_bits, dummy_bits, flags, cmd, addr, size, tx_buf, rx_buf);
        this->transactions.push_back(std::move(trans_ext));
    }

    std::vector<size_t> waitTransaction(size_t num_will_be_queued)
    {
        while (!this->hasTransactionsCompletedAndAllResultsReady(num_will_be_queued)) {
            vTaskDelay(0);
        }
        return this->numBytesReceivedAll();
    }
};

ARDUINO_ESP32_DMA_SPI_NAMESPACE_END

namespace ESP32DMASPI = arduino::esp32::spi::dma;

#endif  // ESP32DMASPI_MASTER_H
